# Rename and remove columns

In [7]:
import pandas as pd
# Original dataframe
df = pd.DataFrame({
    'name': ['zhangsan', 'lisi', 'wangwu', 'zhaoliu'],
    'age': [20, 30, 25, 35],
    'city': ['beijing', 'shanghai', 'guangzhou', 'shenzhen']
}, index=['1', '2', '3', '4'])

df

       name  age       city
1  zhangsan   20    beijing
2      lisi   30   shanghai
3    wangwu   25  guangzhou
4   zhaoliu   35   shenzhen

## Rename columns

In [8]:
# Rename columns using the column mappers
column_mappers = {
    'name':'name1',
    'age':'age1',
    'city':'city1',
}

df = df.rename(
    mapper=column_mappers,
    axis=1 # 1 means col, 0 means row
)

df

      name1  age1      city1
1  zhangsan    20    beijing
2      lisi    30   shanghai
3    wangwu    25  guangzhou
4   zhaoliu    35   shenzhen

## Remove columns

In [9]:
drop_columns = {'city1'}
df = df.drop(
    labels=drop_columns,
    axis=1
)
print(df, "\n")

      name1  age1
1  zhangsan    20
2      lisi    30
3    wangwu    25
4   zhaoliu    35